Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In general, the Quarkus philosophy is to move work from application start to build-time, not the other way round. If you do need to move work into a `postStartHook` or recorder, try to move as little as possible, to avoid negative performance impacts. Often, code needs to know that a Dev Service *will* be created, but not the actual address. This can be handled as part of the normal build flow using a marker build item, leaving the bare minimum to execute as part of the hook.
ja_jp: 一般的に、Quarkus の哲学は作業をアプリケーションの開始時からビルド時に移行することであり、その逆ではありません。作業を `postStartHook` やレコーダーに移動する必要がある場合は、パフォーマンスへの悪影響を避けるために、移動する量を最小限に抑えるようにしてください。多くの場合、コードは Dev Service が作成される *こと* を知る必要がありますが、実際のアドレスを知る必要はありません。これは、マーカービルドアイテムを使用した通常のビルドフローの一部として処理し、フックの一部として実行するものを最小限に抑えることができます。

source: In general, these properties are prefixed using `%prod` to enable them only when running in production mode.
ja_jp: 一般に、これらのプロパティーには `%prod` という接頭辞を付け、本番モードで動作しているときのみ有効化します。

source: In general, use the `throttled` strategy. It provides high-throughput and handles the asynchronous use cases. This strategy is becoming the default strategy in Quarkus 1.10. You can also switch to the `ignore` strategy if the Kafka auto-commit is acceptable for you, or if you want to skip offset commit altogether.
ja_jp: 一般的には、 `throttled` 戦略を使用します。これはハイスループットを提供し、非同期のユースケースを処理します。このストラテジーは、Quarkus 1.10ではデフォルトのストラテジーになっています。また、Kafkaのオートコミットが許容できる場合や、オフセットコミットを完全にスキップしたい場合は、 `ignore` 戦略に切り替えることもできます。

source: In general, you inject a single one; the previous snippet is just an example.
ja_jp: 一般的には、1 つだけ注入します。先ほどのスニペットは単なる一例です。

source: In https://github.com/quarkusio/quarkus-quickstarts/blob/main/hibernate-reactive-panache-quickstart/src/test/java/org/acme/hibernate/orm/panache/FruitsEndpointTest.java[FruitsEndpointTest.java] you can see how the test for the fruit application can be implemented.
ja_jp: link:https://github.com/quarkusio/quarkus-quickstarts/blob/main/hibernate-reactive-panache-quickstart/src/test/java/org/acme/hibernate/orm/panache/FruitsEndpointTest.java[FruitsEndpointTest.java]では、Fruitアプリケーションのテストがどのように実装出来るかを見ることができます。

source: In https://quarkus.io/blog/quarkus-metaprogramming/[this article] we explained how we implemented this feature in Quarkus and the performance improvements it brings. Since then, we have been continuously working to enhance this feature, fix bugs, and improve compatibility with various Jackson features.
ja_jp: https://quarkus.io/blog/quarkus-metaprogramming/[この記事] で、Quarkus でこの機能をどのように実装したか、そしてそれによってもたらされるパフォーマンスの改善について説明しました。それ以来、私たちはこの機能を強化し、バグを修正し、さまざまな Jackson 機能との互換性を改善するために継続的に取り組んできました。

source: In instances where the user is not very active, you can use the `quarkus.oidc.authentication.session-age-extension` property to help handle expired ID tokens. If the ID token expires, the session cookie might not be returned to the Quarkus endpoint during the next user request as the cookie lifespan would have elapsed. Quarkus assumes that this request is the first authentication request.
ja_jp: ユーザーがあまりアクティブでない場合は、 `quarkus.oidc.authentication.session-age-extension` プロパティーを使用して、期限切れの ID トークンを処理できます。 ID トークンの有効期限が切れると、クッキーの有効期間が経過するため、次のユーザーリクエスト時にセッションクッキーが Quarkus エンドポイントに返されない可能性があります。 Quarkus は、このリクエストが最初の認証リクエストであると想定します。

source: In instances where the user is not very active, you can use the `quarkus.oidc.authentication.session-age-extension` property to help handle expired ID tokens. If the ID token expires, the session cookie might not be returned to the Quarkus endpoint during the next user request as the cookie lifespan would have elapsed. Quarkus assumes that this request is the first authentication request. Set `quarkus.oidc.authentication.session-age-extension` to be _reasonably_ long for your barely-active users and in accordance with your security policies.
ja_jp: ユーザーがあまりアクティブでない場合は、 `quarkus.oidc.authentication.session-age-extension` プロパティーを使用して、期限切れの ID トークンを処理できます。 ID トークンの有効期限が切れると、クッキーの有効期間が経過するため、次のユーザーリクエスト時にセッションクッキーが Quarkus エンドポイントに返されない可能性があります。 Quarkus は、このリクエストが最初の認証リクエストであると想定します。 `quarkus.oidc.authentication.session-age-extension` を、ほとんどアクティブでないユーザーとセキュリティーポリシーに合わせて、_適度に_ 長い値に設定します。

source: In keeping with the mantra of providing developer joy, Quarkus provides a host of features when dev mode is enabled. The most important features are:
ja_jp: 開発者満足を提供するという信条のもと、Quarkus は開発モードを有効にすると多くの機能を提供します。最も重要な機能は以下の通りです。

source: In keeping with the mantra of providing developer joy, Quarkus provides a host of features when dev-mode is enabled. The most important features are:
ja_jp: 開発者満足を提供するという信条のもと、Quarkusはdev-modeを有効にすると多くの機能を提供します。最も重要な機能は以下の通りです。

source: In less than 10 minutes, we have a new Quarkus application using AMQP. If you want to go further, check the https://quarkus.io/guides/amqp[AMQP guide].
ja_jp: 10分もしないうちに、AMQPを使った新しいQuarkusアプリケーションができました。もっと詳しく知りたい方は、 link:https://quarkus.io/guides/amqp[AMQPガイド] をチェックしてみてください。

source: In less than 10 minutes, we have a new Quarkus application using Apache Kafka. If you want to go further, check the https://quarkus.io/guides/kafka[Kafka guide].
ja_jp: 10分もしないうちに、Apache Kafkaを使った新しいQuarkusアプリケーションができました。さらに進みたい場合は、 link:https://quarkus.io/guides/kafka[Kafkaガイド]をチェックしてください。

source: In less than a month I've already implemented and deployed at least three new significant prototypes using Quarkus. I can't believe two of them have been rejected already.
ja_jp: 1ヶ月足らずの間に、Quarkusを使って少なくとも3つの新しい重要なプロトタイプを実装し、デプロイしました。そのうちの2つがすでにボツになっていることが信じられません。

source: In listener methods, you can access more information about the transaction in progress by accessing the `TransactionManager`, which is a CDI bean and can be ``@Inject``ed.
ja_jp: リスナーメソッドでは、CDI Beanであり、 `@Inject` 出来る `TransactionManager` にアクセスすることで、進行中のトランザクションに関するより多くの情報にアクセスすることができます。

source: In many cases in order to access the Kubernetes API server a `ServiceAccount`, `Role` and `RoleBinding` will be necessary. An example that allows listing all pods could look something like this:
ja_jp: 多くの場合、Kubernetes API サーバーにアクセスするには `ServiceAccount` 、 `Role` 、 `RoleBinding` が必要になります。すべてのPodをリスト可能な例は以下のようになります。

source: In meantime we will now proceed with fixing the currently failing test using `OidcTestClient`.
ja_jp: ここでは `OidcTestClient` を使用して、現時点で失敗しているテストを修正します。

source: In messaging applications, produced and consumed messages constitute an ordered stream of events, either enforced by the broker (inside a topic or a queue) or by the order of reception and emission in the application. To preserve this order, Quarkus Messaging dispatches messages sequentially by default. You can override this behavior by using `@Blocking(ordered = false)` or `@RunOnVirtualThread` annotation.
ja_jp: メッセージングアプリケーションでは、生成および消費されるメッセージは順序付けられたイベントのストリームを構成します。 これは、(トピックまたはキュー内に) ブローカーによって強制されるか、 アプリケーションの受付および発行の順序によって強制されます。 この順序を維持するために、Quarkus Messaging はデフォルトでメッセージを順番にディスパッチします。 `@Blocking(ordered = false)`または `@RunOnVirtualThread` アノテーションを使用して、この動作をオーバーライドできます。

source: In more advanced cases where the headers and / or status can only be obtained from the results of an async call, the `RestMulti.fromUniResponse` needs to be used. Here is an example of such a use case:
ja_jp: ヘッダーやステータスを非同期呼び出しの結果からのみ取得できるようなより高度なケースでは、 `RestMulti.fromUniResponse` を使用する必要があります。 このような使用例を次に示します。

source: In most cases you can keep using the `/q/webauthn/login-options-challenge` and `/q/webauthn/register-options-challenge` challenge-initiating endpoints, because this is not where custom logic is required.
ja_jp: ほとんどの場合、 `/q/webauthn/login-options-challenge` と `/q/webauthn/register-options-challenge` のチャレンジ開始エンドポイントを使い続けることができます。 ここでは、カスタムロジックが必要ないためです。

source: In most cases, it does not have to be added directly to your project's build file as it is already provided by all of the security extensions. However, if you need to write your own custom security code (for example, register a <<jaxrs-security-context, Custom JAX-RS SecurityContext>>) or use <<bouncy-castle, BouncyCastle>> libraries, then please make sure it is included:
ja_jp: ほとんどの場合、すべてのセキュリティエクステンションですでに提供されているので、プロジェクトのビルドファイルに直接追加する必要はありません。 しかし、独自のセキュリティコード（例えば、 xref:jaxrs-security-context[Custom JAX-RS SecurityContext] を登録）を書いたり、 xref:bouncy-castle[BouncyCastle] のライブラリを使用する必要がある場合は、必ずインクルードしてください：

source: In most cases, it does not have to be added directly to your project's build file as it is already provided by all the security extensions. However, if you need to write your own custom security code (for example, register a <<jaxrs-security-context, Custom JAX-RS SecurityContext>>) or use <<bouncy-castle, BouncyCastle>> libraries, then please make sure it is included:
ja_jp: ほとんどの場合、すべてのセキュリティエクステンションによってすでに追加されているので、プロジェクトの `pom.xml` に直接追加する必要はありません。しかし、独自のカスタムセキュリティコードを書く必要がある場合（例えば、 link:#jaxrs-security-context[カスタムJAX-RS SecurityContext]の登録など）や、 link:#bouncy-castle[BouncyCastle]ライブラリを使用する場合は、必ず追加してください。 :

source: In most cases, it does not have to be added directly to your project's build file as it is already provided by all the security extensions. However, if you need to write your own custom security code (for example, register a <<jaxrs-security-context,Custom Jakarta REST SecurityContext>>) or use <<bouncy-castle,BouncyCastle>> libraries, then please make sure it is included:
ja_jp: すべてのセキュリティエクステンションですでに提供されているので、ほとんどの場合プロジェクトのビルドファイルに直接追加する必要はありません。しかし、独自のセキュリティコードを書いたり（例えば、 xref:jaxrs-security-context[Custom Jakarta REST SecurityContext] を登録したり）、 xref:bouncy-castle[BouncyCastle] ライブラリを使用する必要がある場合は、必ずインクルードしてください：

source: In most cases, it does not have to be added directly to your project's build file as it is already provided by all the security extensions. However, if you need to write your own custom security code (for example, register a xref:jaxrs-security-context[Custom Jakarta REST SecurityContext]) or use xref:bouncy-castle[BouncyCastle] libraries, then please make sure it is included:
ja_jp: ほとんどの場合、すべてのセキュリティエクステンションですでに提供されているため、プロジェクトのビルドファイルに直接追加する必要はありません。しかし、独自のカスタムセキュリティコードを書いたり（例えば、 xref:jaxrs-security-context[カスタム Jakarta SecurityContext] を登録したり）、 xref:bouncy-castle[BouncyCastle] ライブラリを使用する必要がある場合は、必ず含まれていることを確認してください:

source: In most cases, the configuration above will be optional as either a JDBC driver or a reactive datasource extension will be present, not both.
ja_jp: ほとんどの場合、JDBC ドライバーまたはリアクティブデータソースエクステンションのどちらかが存在し、両方は存在しないため、上記の構成はオプションになります。

source: In most cases, when the token arrives, its key identifier `kid` header value is used to find a matching JWK verification key. However, some providers do not set a token `kid` header but provide a JWK key set which may contain more than one verification key. Set `quarkus.oidc.jwks.try-all=true` only to support such cases, letting Quarkus OIDC iterate over all the keys in the JWK set and find the key that can be used to verify the current token's signature.
ja_jp: ほとんどの場合、トークンが到着すると、そのキー識別子 `kid` ヘッダー値を使用して、一致する JWK 検証鍵が検索されます。しかし、一部のプロバイダーはトークンの `kid` ヘッダーを設定せず、複数の検証鍵を含む JWK キーセットを提供します。このようなケースをサポートするためだけに `quarkus.oidc.jwks.try-all=true` を設定し、Quarkus OIDC が JWK セット内のすべてのキーを反復処理して、現在のトークンの署名を検証するために使用できるキーを見つけられるようにします。

source: In most cases, you do not need to deal with the `quarkus.oidc.tenant-id` property unless you have multiple OIDC tenant configuration requirements and create an OIDC tenant configuration `programmatically`. If you configure OIDC tenants in `application.properties`, then, as you can see from the xref:security-oidc-configuration-properties-reference.adoc[OIDC Configuration properties reference] document, the tenant id is declared as a 3rd token in the tenant-specific group of properties.
ja_jp: ほとんどの場合、複数の OIDC テナント設定要件があり、OIDC テナント設定を `プログラムで` 作成しない限り、 `quarkus.oidc.tenant-id` プロパティーを扱う必要はありません。 `application.properties` で OIDC テナントを設定する場合、xref:security-oidc-configuration-properties-reference.adoc[OIDC 設定プロパティーリファレンス] ドキュメントからわかるように、テナント ID はテナント固有のプロパティーグループの 3 番目のトークンとして宣言されます。

source: In most cases, you generate the Quarkus Development CA once and then generate certificates signed by this CA. The Quarkus Development CA is a Certificate Authority that can be used to sign certificates locally. It is only valid for development purposes and only trusted on the local machine. The generated CA is located in `$HOME/.quarkus/quarkus-dev-root-ca.pem`, and installed in the system truststore.
ja_jp: ほとんどの場合、Quarkus Development CA を一度生成してから、この CA によって署名された証明書を生成します。 Quarkus Development CA は、ローカルで証明書に署名するために使用できる認証局です。 これは開発目的にのみ有効であり、ローカルマシン上でのみ信頼されます。 生成された CA は `$HOME/.quarkus/quarkus-dev-root-ca.pem` に配置され、システムトラストストアにインストールされます。

source: In most cases, you generate the Quarkus Development CA once and then generate certificates signed by this CA. The Quarkus Development CA is a Certificate Authority that can be used to sign certificates locally. It is valid only for development purposes and is trusted only on the local machine.
ja_jp: ほとんどの場合、Quarkus 開発用 CA を一度生成してから、この CA によって署名された証明書を生成します。Quarkus 開発用 CA は、ローカルで証明書に署名するために使用できる認証局です。これは開発目的でのみ有効であり、ローカルマシン上でのみ信頼されます。

source: In most cases, you only need a single pair consisting of a certificate and a private key. Even if the certificate is part of a certificate chain, it includes only one private key that corresponds to the end-entity certificate.
ja_jp: ほとんどの場合、証明書と秘密鍵で構成されるペアが 1 つだけ必要です。 証明書が証明書チェーンの一部である場合でも、キーストアに含まれる秘密鍵は、エンドエンティティー証明書に対応するもの 1 つだけです。

source: In most cases:
ja_jp: ほとんどの場合だ：

source: In multi-module Maven projects we recommend to have an explicit `compile` call to ensure compilation happens before the `quarkus:dev` goal is executed.
ja_jp: マルチモジュール Maven プロジェクトでは、 `quarkus:dev` ゴールが実行される前にコンパイルが行われるように、明示的な `compile` 呼び出しを行うことを推奨します。

source: In native mode, Snappy is disabled by default as the use of Snappy requires embedding a native library and unpacking it when the application starts.
ja_jp: ネイティブモードでは、Snappyはデフォルトで無効になっています。Snappyを使用するには、ネイティブライブラリを埋め込み、アプリケーションの起動時にそれを展開する必要があるからです。

source: In native mode, embedding H2 in the native image is not recommended. Use a remote connection to a separate database, or use Dev Services to run the database outside the native image.
ja_jp: ネイティブモードでは、ネイティブイメージ内に H2 を埋め込むことは推奨されません。別のデータベースへのリモート接続を使用するか、Dev Services を使用してネイティブイメージの外部でデータベースを実行してください。

source: In native mode:
ja_jp: ネイティブモードの場合:

source: In non-CDI contexts, use the API `io.smallrye.config.SmallRyeConfig#getConfigMapping` to retrieve the config mapping instance:
ja_jp: CDI以外のコンテキストでは、API `io.smallrye.config.SmallRyeConfig#getConfigMapping` を使用して、設定マッピングインスタンスを取得します。

source: In non-native pure JVM mode, there is no real difference between Static and Runtime Init, except that Static Init is always executed first. This mode benefits from the same build phase augmentation as native mode as the descriptor parsing and annotation scanning are done at build time and any associated class/framework dependencies can be removed from the build output jar. In servers like WildFly, deployment related classes such as XML parsers hang around for the life of the application, using up valuable memory. Quarkus aims to eliminate this, so that the only classes loaded at runtime are actually used at runtime.
ja_jp: 非ネイティブのピュアJVMモードでは、Static Init とランタイム起動に実質的な違いはありませんが、Static Init が常に最初に実行される点で異なります。このモードでは、記述子の解析とアノテーションのスキャンがビルド時に行われ、関連するクラスやフレームワークの依存関係がビルド出力 jar から削除されるため、ネイティブモードと同様のビルドフェーズのエクステンションが利用できます。WildFly のようなサーバーでは、XML パーサーなどの展開関連クラスがアプリケーションの存続期間中、貴重なメモリを使用してぶら下がっています。Quarkus は、このようなことをなくし、実行時にロードされるクラスのみが実行時に実際に使用されるようにすることを目指しています。

source: In normal CDI, classes that are marked as `final` and / or have `final` methods are not eligible for proxy creation, which in turn means that interceptors and normal scoped beans don't work properly. This situation is very common when trying to use CDI with alternative JVM languages like Kotlin where classes and methods are `final` by default.
ja_jp: 通常の CDI では、 `final` としてマークされているクラス、または `final` メソッドを持つクラスは、プロキシー作成の対象になりません。これは、インターセプターと通常のスコープ Bean が正しく動作しないことを意味します。このような状況は、クラスおよびメソッドがデフォルトで `final`である Kotlin のような代替 JVM 言語で CDI を使用しようとするときに非常に一般的です。

source: In normal CDI, classes that are marked as `final` and / or have `final` methods are not eligible for proxy creation, which in turn means that interceptors and normal scoped beans don't work properly. This situation is very common when trying to use CDI with alternative JVM languages like Kotlin, where classes and methods are `final` by default.
ja_jp: 通常の CDI では、`final` とマークされている、または `final` メソッドを持つクラスはプロキシー作成の対象外となります。これは、インターセプターと通常のスコープ Bean が正しく動作しないことを意味します。この状況は、Kotlin のようにクラスとメソッドがデフォルトで `final` である代替 JVM 言語で CDI を使用しようとすると、非常によく発生します。

source: In order for Hibernate ORM to generate more efficient SQL, to avoid workarounds and to take advantage of more database features, you can set the database version explicitly:
ja_jp: Hibernate ORMがより効率的なSQLを生成し、 ワークアラウンドを回避し、より多くのデータベース機能を活用するために、 データベースバージョンを明示的に設定することができます:

source: In order for automatic context propagation, such as Mutiny uses, to be overridden in specific methods, you can use the https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/CurrentThreadContext.html[`@CurrentThreadContext`] annotation:
ja_jp: Mutinyが使用しているような自動コンテキスト伝搬を、特定のメソッドでオーバーライドするためには link:https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/CurrentThreadContext.html[`@CurrentThreadContext`] アノテーションを使用します:

source: In order for the Nisse Maven plugin to generate the correct properties, we need to make sure the `nisse.compat.osDetector` system property is set. This can be done by adding the following `.mvn/maven.config` file:
ja_jp: Nisse Maven プラグインが正しいプロパティを生成するには、 `nisse.compat.osDetector` システム・プロパティが設定されているようにする必要があります。 これは、次の `.mvn/maven.config` ファイルを追加することで可能です：

source: In order for the STM subsystem to have knowledge about which classes are to be managed within the context of transactional memory it is necessary to provide a minimal level of instrumentation. This occurs by categorising STM-aware and STM-unaware classes through an interface boundary; specifically all STM-aware objects must be instances of classes which inherit from interfaces that themselves have been annotated to identify them as STM-aware. Any other objects (and their classes) which do not follow this rule will not be managed by the STM subsystem and hence any of their state changes will not be rolled back, for example.
ja_jp: STM サブシステムが、トランザクションメモリーのコンテキスト内でどのクラスが管理されるべきかを認識するには最低限の手段を提供する必要があります。これは、STM を意識したクラス STM を意識しないクラスをインターフェース境界で分類することで行います。特に、すべての STM 対応オブジェクトは、STM 対応として識別するためのアノテーションが付けられているインターフェースから継承するクラスのインストタンスである必要があります。このルールに従わない他のオブジェクト (およびそのクラス) は、STM サブシステムによって管理されません。そのため、それらの状態の変更はロールバックされません。

source: In order for this plugin to generate the correct properties, we need to make sure the `nisse.compat.osDetector` system property is set. This can be done by adding the following `.mvn/maven.config` file:
ja_jp: このプラグインが正しいプロパティを生成するためには、 `nisse.compat.osDetector` システム・プロパティが設定されていることを確認する必要があります。 これは、以下の `.mvn/maven.config` ファイルを追加することで可能です：

source: In order for your template to read custom information from your Quarkus extension, you can use the `info` xref:qute-reference.adoc#namespace_extension_methods[namespace].
ja_jp: テンプレートがQuarkusエクステンションからカスタム情報を読み取るためには、 `info` link:qute-reference.html#namespace_extension_methods[名前空間]を使用することができます。

source: In order of precedence (greater precedence first):
ja_jp: 優先順位の高い順 (優先順位が高い方が先):

source: In order to access the admin endpoint you should obtain a token for the `admin` user:
ja_jp: admin エンドポイントにアクセスするには、 `admin` ユーザーのトークンを取得する必要があります。

source: In order to authenticate to the application you should type the following credentials when at the Keycloak login page:
ja_jp: アプリケーションを認証するためには、Keycloakのログインページで以下の認証情報を入力する必要があります。

source: In order to automate extension releases and publication of docs, there are some rules that need to be followed for projects under the Quarkiverse organization:
ja_jp: エクステンションのリリースやドキュメントの公開を自動化するために、Quarkiverseの組織の下にあるプロジェクトでは、いくつかのルールに従う必要があります。

source: In order to avoid duplicates in case of failure, it is recommended to enable message deduplication and batch index level acknowledgment on the broker side:
ja_jp: 失敗発生時に重複を回避するために、ブローカー側でメッセージの重複排除とバッチインデックスレベルの確認応答を有効にすることを推奨します。

source: In order to avoid this wasting of resource without modifying Netty upstream, we wrote an extension that modifies the bytecode of the class responsible for creating the thread locals at build time. Using this extension, performance of virtual threads in Quarkus for the Json Serialization test of the Techempower suite increased by nearly 80%, making it almost as good as reactive endpoints.
ja_jp: アップストリームのNettyに手を加えることなくこのリソースの浪費を避けるために、ビルド時にスレッドローカルの作成を担当するクラスのバイトコードを変更するエクステンションを書きました。このエクステンションを使うと、TechempowerスイートのJsonのSerializationのテストにおけるQuarkusの仮想スレッドのパフォーマンスが80%近く向上し、リアクティブエンドポイントとほぼ同等になりました。

source: In order to be used, transaction support needs to be activated on the broker configuration, using `transactionCoordinatorEnabled=true` and `systemTopicEnabled=true` broker configuration.
ja_jp: 使用するには、ブローカー設定で `transactionCoordinatorEnabled=true` および `systemTopicEnabled=true` を使用して、トランザクションのサポートを有効にする必要があります。

source: In order to benefit from the same style as other Dev UI pages, extend the `main` template
ja_jp: 他の Dev UI ページと同じスタイルを利用するには、 `main` テンプレートを拡張します。

source: In order to configure the JSON logging format, the `quarkus-logging-json` extension may be employed. Add this extension to your build file as the following snippet illustrates:
ja_jp: JSON ログフォーマットを設定するために、 `quarkus-logging-json` エクステンションモジュールを使用することができます。次のスニペットが示すように、このエクステンションをアプリケーションPOMに追加してください。

source: In order to cover the broadest possible range of use cases, we invite you to test your applications with this feature enabled, possibly also measuring its impact on performances. If you encounter any issues or have feedback, please report them on our GitHub repository or reach out to us on the Quarkus community channels. This will help us to be more confident about the stability of this feature and ensure a smooth transition for all users.
ja_jp: 可能な限り幅広いユースケースをカバーするために、この機能を有効にした状態でアプリケーションをテストし、できればパフォーマンスへの影響も測定していただくようお願いします。問題に遭遇した場合やフィードバックがある場合は、GitHub リポジトリーに報告するか、Quarkus コミュニティー チャネルでお知らせください。これは、この機能の安定性についてより確信を持ち、すべてのユーザーにスムーズな移行を保証するのに役立ちます。

source: In order to create one interceptor instance per entity manager instead, annotate your bean with `@Dependent`. In that case, the interceptor implementation doesn't need to be thread-safe.
ja_jp: エンティティマネージャーごとに1つのインターセプターのインスタンスを作成するには、Beanに `@Dependent` アノテーションを付けます。この場合はインターセプターの実装はスレッドセーフである必要はありません。

source: In order to deserialize the object from Elasticsearch, we again use Vert.x JsonObject.
ja_jp: Elasticsearchからオブジェクトをデシリアライズするために、再びVert.x JsonObjectを使用します。

source: In order to deserialize the object from Elasticsearch, we again use Vert.x `JsonObject`.
ja_jp: Elasticsearchからオブジェクトをデシリアライズするために、再びVert.x `JsonObject` を使用します。

source: In order to determine the base URL to which REST calls will be made, the REST Client uses configuration from `application.properties`. The name of the property needs to follow a certain convention which is best displayed in the following code:
ja_jp: REST 呼び出しが行われるベース URL を決定するために、REST クライアントは `application.properties` からの設定を使用します。プロパティーの名前は、以下のコードで表示される特定の規則に従う必要があります。

source: In order to do this, entities need to be loaded from that other datastore, and such loading must be implemented explicitly.
ja_jp: これを実行するには、エンティティーを他のデータストアからロードする必要があります。 このようなロードは、明示的に実装する必要があります。
